Reports/ЛБ_ОтчетИсторияИзмененияЗалогодателяСтарый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ОтчетИсторияИзмененияЗалогодателяСтарый</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЛБ_ОтчетИсторияИзмененияЗалогодателяСтарый/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Залогодатель") Тогда
		Отчет.Залогодатель = Параметры.Залогодатель;
		Если ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
			Отчет.НачПериода = Дата(1,1,1);
			Отчет.КонПериода = Дата(1,1,1);
			СформироватьНаСервере();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтервал(Команда)
	
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.НачПериода	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.КонПериода 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
		Сообщить("Не выбран залогодатель!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуИзменений(Изменения, ТаблицаИзменений)
	 ТаблицаИзменений.Очистить();
	 КоличествоСтрок = СтрЧислоСтрок(Изменения);
	 Для НомерСтроки = 1 По КоличествоСтрок Цикл   
		 ИсходнаяСтрока = СтрПолучитьСтроку(Изменения, НомерСтроки);
		 Поз = Найти(ИсходнаяСтрока, "Изменен");
		 Если НЕ Поз = 0 Тогда
			 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 7);  
			 Пока НЕ Лев(ИсходнаяСтрока, 1) = " " Цикл  
				  ИсходнаяСтрока = " " + Сред(ИсходнаяСтрока, 2);
			 КонецЦикла;	 
			 
			 Поз = Найти(ИсходнаяСтрока, " с "); 
			 Если НЕ Поз = 0 Тогда 
				 Вид = СокрЛП(Сред(ИсходнаяСтрока, 1, Поз-1)); 
				 НоваяСтр = ТаблицаИзменений.Добавить(); 
				 НоваяСтр.Вид = Врег(Лев(Вид,1)) + Сред(Вид, 2);
				 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 2);
				 
				 Поз = Найти(ИсходнаяСтрока, " на ");
				 Если НЕ Поз = 0 Тогда 
					 СтароеЗнч = Сред(ИсходнаяСтрока, 1, Поз-1);
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, "<", "");
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, ">", ""); 
					 СтароеЗнч = СокрЛП(СтароеЗнч);  
					 НоваяСтр.ЗначениеСтарое = СтароеЗнч;  
					 
					 НовоеЗнч = Сред(ИсходнаяСтрока, Поз+3);
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, "<", "");
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, ">", ""); 
					 НовоеЗнч = СокрЛП(НовоеЗнч);  
					 НоваяСтр.ЗначениеНовое = НовоеЗнч;
				 КонецЕсли;	 
			 КонецЕсли;	 
		 КонецЕсли;	 
	 КонецЦикла;
	 Возврат ТаблицаИзменений;
 КонецФункции      
 
 &НаСервере
Функция ПолучитьТаблицуИзмененийДок(Изменения, ПричинаИзменения, Документ, ТаблицаИзменений)
	 КоличествоСтрок = СтрЧислоСтрок(Изменения);
	 Для НомерСтроки = 1 По КоличествоСтрок Цикл   
		 ИсходнаяСтрока = СтрПолучитьСтроку(Изменения, НомерСтроки);
		 Поз = Найти(ИсходнаяСтрока, "Изменен");
		 Если НЕ Поз = 0 Тогда
			 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 7);  
			 Пока НЕ Лев(ИсходнаяСтрока, 1) = " " Цикл  
				  ИсходнаяСтрока = " " + Сред(ИсходнаяСтрока, 2);
			 КонецЦикла;	 
			 
			 Поз = Найти(ИсходнаяСтрока, " с "); 
			 Если НЕ Поз = 0 Тогда 
				 Вид = СокрЛП(Сред(ИсходнаяСтрока, 1, Поз-1)); 
				 НоваяСтр = ТаблицаИзменений.Добавить(); 
				 НоваяСтр.Вид = Врег(Лев(Вид,1)) + Сред(Вид, 2);  
				 НоваяСтр.ПричинаИзменения = ПричинаИзменения;
			     НоваяСтр.Документ = Документ;
				 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 2);
				 
				 Поз = Найти(ИсходнаяСтрока, " на ");
				 Если НЕ Поз = 0 Тогда 
					 СтароеЗнч = Сред(ИсходнаяСтрока, 1, Поз-1);
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, "<", "");
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, ">", ""); 
					 СтароеЗнч = СокрЛП(СтароеЗнч);  
					 НоваяСтр.ЗначениеСтарое = СтароеЗнч;  
					 
					 НовоеЗнч = Сред(ИсходнаяСтрока, Поз+3);
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, "<", "");
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, ">", ""); 
					 НовоеЗнч = СокрЛП(НовоеЗнч);  
					 НоваяСтр.ЗначениеНовое = НовоеЗнч;
				 КонецЕсли;	 
			 КонецЕсли;	 
		 КонецЕсли;	 
	 КонецЦикла;   
	 Если ТаблицаИзменений.Количество() = 0 Тогда 
		 Если Изменения = "Создан новый документ" Тогда
			 НоваяСтр = ТаблицаИзменений.Добавить(); 
			 НоваяСтр.ПричинаИзменения = ?(ЗначениеЗаполнено(ПричинаИзменения), ПричинаИзменения, Изменения);
			 НоваяСтр.Документ = Документ;
			 НоваяСтр.Вид = "";
			 НоваяСтр.ЗначениеСтарое = ""; 
			 НоваяСтр.ЗначениеНовое = "";
         КонецЕсли;
	 КонецЕсли;	 
	 Возврат ТаблицаИзменений;
КонецФункции


&НаСервере
Процедура СформироватьНаСервере()
	
	ТаблицаИзменений = Новый ТаблицаЗначений; 
	ТаблицаИзменений.Колонки.Добавить("Вид"); 
	ТаблицаИзменений.Колонки.Добавить("ЗначениеСтарое");
	ТаблицаИзменений.Колонки.Добавить("ЗначениеНовое");
	
	ТаблицаИзмененийДок = Новый ТаблицаЗначений; 
	ТаблицаИзмененийДок.Колонки.Добавить("Документ");
	ТаблицаИзмененийДок.Колонки.Добавить("ПричинаИзменения");
	ТаблицаИзмененийДок.Колонки.Добавить("Вид"); 
	ТаблицаИзмененийДок.Колонки.Добавить("ЗначениеСтарое");
	ТаблицаИзмененийДок.Колонки.Добавить("ЗначениеНовое"); 
	ТаблицаИзмененийДок.Колонки.Добавить("Обработано");

	
	ДокументРезультат.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Отчет.Залогодатель); 
	Запрос.УстановитьПараметр("ПустаяПричинаИзмененияФИО", Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПериодНач", Отчет.НачПериода);
	Запрос.УстановитьПараметр("ПериодКон", ?(Отчет.КонПериода = Дата(1,1,1), ТекущаяДата(), КонецДня(Отчет.КонПериода)));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Период КАК Период,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Регистратор КАК Регистратор,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзменения КАК ПричинаИзменения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзмененияФИО КАК ПричинаИзмененияФИО,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Ответственный КАК Ответственный,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Изменения КАК Изменения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ОснованиеИзмененияФИО КАК ОснованиеИзмененияФИО
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
	               |ГДЕ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = &Залогодатель
	               |	И ЛБ_КонтактнаяИнформацияЗалогодателей.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛБ_АнкетаЗалогодателя.Период,
	               |	ЛБ_АнкетаЗалогодателя.Регистратор,
	               |	ЛБ_АнкетаЗалогодателя.ПричинаИзменения,
	               |	&ПустаяПричинаИзмененияФИО,
	               |	ЛБ_АнкетаЗалогодателя.Ответственный,
	               |	ЛБ_АнкетаЗалогодателя.Изменения,
	               |	""""
	               |ИЗ
	               |	РегистрСведений.ЛБ_АнкетаЗалогодателя КАК ЛБ_АнкетаЗалогодателя
	               |ГДЕ
	               |	ЛБ_АнкетаЗалогодателя.Залогодатель = &Залогодатель
	               |	И ЛБ_АнкетаЗалогодателя.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаКИ = Запрос.Выполнить().Выгрузить();
	ТаблицаКарточкаЗалогодателя = ТаблицаКИ.Скопировать();
	ТаблицаКарточкаЗалогодателя.Свернуть("Период, Регистратор");
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.Период КАК Период,
	               |	ЛБ_ДокументыЗалогодателей.Регистратор КАК Регистратор,
	               |	ЛБ_ДокументыЗалогодателей.ПричинаИзменения КАК ПричинаИзменения,
	               |	ЛБ_ДокументыЗалогодателей.Ответственный КАК Ответственный,
	               |	ЛБ_ДокументыЗалогодателей.Изменения КАК Изменения,
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Залогодатель
	               |	И ЛБ_ДокументыЗалогодателей.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаДок = Запрос.Выполнить().Выгрузить();
	
	Для каждого Выборка Из ТаблицаДок Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			НоваяСтр.Период = Выборка.Период;
			НоваяСтр.Регистратор = Выборка.Регистратор;
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаКарточкаЗалогодателя.Свернуть("Период, Регистратор");
	ТаблицаКарточкаЗалогодателя.Сортировать("Период");
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИсторияИзмененияКонтактнойИнформацииЗалогодателя";

	Макет 			 = Отчет.РеквизитМакет;
	
	ОбластьШапки 	 = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки 	 = Макет.ПолучитьОбласть("Строка");
	ОбластьСтроки1 	 = Макет.ПолучитьОбласть("Строка1");
	ОбластьСтроки2 	 = Макет.ПолучитьОбласть("Строка2");
	ОбластьПодвала 	 = Макет.ПолучитьОбласть("Подвал");

	ОбластьШапки.Параметры.Залогодатель = Отчет.Залогодатель;   
	Если Отчет.НачПериода = Дата(1,1,1) И Отчет.КонПериода = Дата(1,1,1) Тогда 
		ОбластьШапки.Параметры.Период = " по " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ИначеЕсли Отчет.НачПериода = Дата(1,1,1) Тогда
		ОбластьШапки.Параметры.Период = " по " + Формат(Отчет.КонПериода, "ДФ=dd.MM.yyyy");    
	ИначеЕсли Отчет.КонПериода = Дата(1,1,1) Тогда
		ОбластьШапки.Параметры.Период = " с " + Формат(Отчет.НачПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
    Иначе	
	    ОбластьШапки.Параметры.Период =  " с " + Формат(Отчет.НачПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(Отчет.КонПериода, "ДФ=dd.MM.yyyy");   
	КонецЕсли;	
    ДокументРезультат.Вывести(ОбластьШапки);
	
	СтрокаТаблицы = 3;
	Для каждого СтрДок Из ТаблицаКарточкаЗалогодателя Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", СтрДок.Период);
		Отбор.Вставить("Регистратор", СтрДок.Регистратор);
		
		СтрокиКИ = ТаблицаКИ.НайтиСтроки(Отбор);
		
		Если НЕ СтрокиКИ.Количество() = 0 Тогда
            СтрК = СтрокиКИ.Получить(0);
						
			ТаблицаИзменений = ПолучитьТаблицуИзменений(СтрК.Изменения, ТаблицаИзменений);
						
			СтрокиДок = ТаблицаДок.НайтиСтроки(Отбор);
			Если СтрокиДок.Количество() = 0 Тогда  
				ТаблицаИзмененийДок.Очистить();
			Иначе	    			
				ТаблицаИзмененийДок.Очистить();
				Для каждого Стр Из СтрокиДок Цикл  
					ТаблицаИзмененийДок = ПолучитьТаблицуИзмененийДок(Стр.Изменения, Стр.ПричинаИзменения, Стр.ДокументЗалогодателя, ТаблицаИзмененийДок);
					ТаблицаИзмененийДок.ЗаполнитьЗначения(ложь, "Обработано");
				Конеццикла;
			КонецЕсли; 
			
			Если ТаблицаИзменений.Количество() = 0 И ТаблицаИзмененийДок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			ОбластьСтроки.Параметры.Период = СтрК.Период;
			СтруктураР = Новый Структура; 
			СтруктураР.Вставить("Залогодатель", Отчет.Залогодатель);
			СтруктураР.Вставить("Дата", СтрК.Период);
			ОбластьСтроки.Параметры.СтруктураР = СтруктураР;
			ОбластьСтроки.Параметры.Ответственный = СтрК.Ответственный;
			Если НЕ ЗначениеЗаполнено(СтрК.ПричинаИзмененияФИО) ИЛИ (СтрК.ПричинаИзменения = СтрК.ПричинаИзмененияФИО) Тогда 
				ПричинаИзмененияКИ = СтрК.ПричинаИзменения;
			Иначе
				ПричинаИзмененияКИ = СокрЛП(СтрК.ПричинаИзменения) + Символы.ПС + "Причина изменения ФИО: " + СокрЛП(СтрК.ПричинаИзмененияФИО) + 
				    ?(ПустаяСтрока(СтрК.ОснованиеИзмененияФИО), "", ", основание изменения: " + СокрЛП(СтрК.ОснованиеИзмененияФИО));				
			КонецЕсли;	  
			ОбластьСтроки.Параметры.ПричинаИзмененияКИ = ПричинаИзмененияКИ;

			
			Ном = 0;    
			СтрНач = 0;
			СтрКон = 0;  
			Документ = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
			Для каждого СтрКИ Из ТаблицаИзменений Цикл 
				Если Ном = 0 Тогда
					ОбластьСтроки.Параметры.ВидКИ = СтрКИ.Вид;
					ОбластьСтроки.Параметры.СтароеКИ = СтрКИ.ЗначениеСтарое;
					ОбластьСтроки.Параметры.НовоеКИ = СтрКИ.ЗначениеНовое; 
					СтрокаТаблицы = СтрокаТаблицы + 1;  
					
					Отбор = Новый Структура;
					Отбор.Вставить("Обработано", ложь);  
					Строки = ТаблицаИзмененийДок.НайтиСтроки(Отбор);
					Если НЕ Строки.Количество() = 0 Тогда
						СтрДок = Строки.Получить(0);
						СтрДок.Обработано = Истина;   
						ОбластьСтроки.Параметры.Документ = СтрДок.Документ;
						ОбластьСтроки.Параметры.ПричинаИзмененияДок = СтрДок.ПричинаИзменения;
						ОбластьСтроки.Параметры.ВидДок = СтрДок.Вид;
						ОбластьСтроки.Параметры.СтароеДок = СтрДок.ЗначениеСтарое;
						ОбластьСтроки.Параметры.НовоеДок = СтрДок.ЗначениеНовое;  
						СтрНач = СтрокаТаблицы;
						СтрКон = СтрНач;  
						Документ = СтрДок.Документ;
					Иначе 
						ОбластьСтроки.Параметры.Документ = "";
						ОбластьСтроки.Параметры.ПричинаИзмененияДок = "";
						ОбластьСтроки.Параметры.ВидДок = "";
						ОбластьСтроки.Параметры.СтароеДок = "";
						ОбластьСтроки.Параметры.НовоеДок = "";
					КонецЕсли;	
					ДокументРезультат.Вывести(ОбластьСтроки); 
					Ном = Ном + 1;
				Иначе                                                       
					ОбластьСтроки1.Параметры.СтруктураР = СтруктураР;
					ОбластьСтроки1.Параметры.ВидКИ = СтрКИ.Вид;
					ОбластьСтроки1.Параметры.СтароеКИ = СтрКИ.ЗначениеСтарое;
					ОбластьСтроки1.Параметры.НовоеКИ = СтрКИ.ЗначениеНовое;  
					СтрокаТаблицы = СтрокаТаблицы + 1;
						
					Отбор = Новый Структура;
					Отбор.Вставить("Обработано", ложь);  
					Строки = ТаблицаИзмененийДок.НайтиСтроки(Отбор);
					Если НЕ Строки.Количество() = 0 Тогда
						СтрДок = Строки.Получить(0);
						СтрДок.Обработано = Истина;     
						Если НЕ Документ.Пустая() И НЕ Документ = СтрДок.Документ Тогда 
							Если НЕ СтрНач = СтрКон Тогда  
								ДокументРезультат.Область(СтрНач,7,СтрКон,7).Объединить(); 
								ДокументРезультат.Область(СтрНач,8,СтрКон,8).Объединить();
							КонецЕсли;	
                            СтрНач = СтрокаТаблицы;
						    СтрКон = СтрНач-1;  
						    Документ = СтрДок.Документ;
						КонецЕсли;	
						ОбластьСтроки1.Параметры.Документ = СтрДок.Документ;
						ОбластьСтроки1.Параметры.ПричинаИзмененияДок = СтрДок.ПричинаИзменения;
						ОбластьСтроки1.Параметры.ВидДок = СтрДок.Вид;
						ОбластьСтроки1.Параметры.СтароеДок = СтрДок.ЗначениеСтарое;
						ОбластьСтроки1.Параметры.НовоеДок = СтрДок.ЗначениеНовое; 						
					Иначе 
						ОбластьСтроки1.Параметры.Документ = "";
						ОбластьСтроки1.Параметры.ПричинаИзмененияДок = "";
						ОбластьСтроки1.Параметры.ВидДок = "";
						ОбластьСтроки1.Параметры.СтароеДок = "";
						ОбластьСтроки1.Параметры.НовоеДок = ""; 
					КонецЕсли;	 
					СтрКон = СтрКон + 1;
					ДокументРезультат.Вывести(ОбластьСтроки1); 					
				КонецЕсли;	
			КонецЦикла;	    
			Отбор = Новый Структура;
			Отбор.Вставить("Обработано", ложь);  
			Строки = ТаблицаИзмененийДок.НайтиСтроки(Отбор); 
			Для каждого СтрДок Из Строки Цикл
				Если Ном = 0 Тогда  					
					ОбластьСтроки.Параметры.ВидКИ = "";
					ОбластьСтроки.Параметры.СтароеКИ = "";
					ОбластьСтроки.Параметры.НовоеКИ = ""; 
					СтрокаТаблицы = СтрокаТаблицы + 1;

					ОбластьСтроки.Параметры.Документ = СтрДок.Документ;
					ОбластьСтроки.Параметры.ПричинаИзмененияДок = СтрДок.ПричинаИзменения;
					ОбластьСтроки.Параметры.ВидДок = СтрДок.Вид;
					ОбластьСтроки.Параметры.СтароеДок = СтрДок.ЗначениеСтарое;
					ОбластьСтроки.Параметры.НовоеДок = СтрДок.ЗначениеНовое;  
					ДокументРезультат.Вывести(ОбластьСтроки); 					 
					СтрНач = СтрокаТаблицы;
					СтрКон = СтрНач;  
					Документ = СтрДок.Документ;
					Ном = Ном + 1;
				Иначе              
					//ОбластьСтроки2.Параметры.СтруктураР = СтруктураР;
					//ОбластьСтроки2.Параметры.ВидКИ = "";
					//ОбластьСтроки2.Параметры.СтароеКИ = "";
					//ОбластьСтроки2.Параметры.НовоеКИ = "";   
					СтрокаТаблицы = СтрокаТаблицы + 1;

					Если НЕ Документ.Пустая() И НЕ Документ = СтрДок.Документ Тогда 
						Если НЕ СтрНач = СтрКон Тогда  
							ДокументРезультат.Область(СтрНач,7,СтрКон,7).Объединить(); 
							ДокументРезультат.Область(СтрНач,8,СтрКон,8).Объединить();
						КонецЕсли;	
                        СтрНач = СтрокаТаблицы;
					    СтрКон = СтрНач-1;  
					    Документ = СтрДок.Документ;
					КонецЕсли;						
					ОбластьСтроки2.Параметры.Документ = СтрДок.Документ;
					ОбластьСтроки2.Параметры.ПричинаИзмененияДок = СтрДок.ПричинаИзменения;
					ОбластьСтроки2.Параметры.ВидДок = СтрДок.Вид;
					ОбластьСтроки2.Параметры.СтароеДок = СтрДок.ЗначениеСтарое;
					ОбластьСтроки2.Параметры.НовоеДок = СтрДок.ЗначениеНовое;  
                    ДокументРезультат.Вывести(ОбластьСтроки2);                 
					СтрКон = СтрКон + 1;
				КонецЕсли;	                     
			КонецЦикла; 
			Если НЕ Документ.Пустая() Тогда
				Если НЕ СтрНач = СтрКон Тогда  
					ДокументРезультат.Область(СтрНач,7,СтрКон,7).Объединить(); 
					ДокументРезультат.Область(СтрНач,8,СтрКон,8).Объединить();
				КонецЕсли;	
            КонецЕсли;
		Иначе	
			СтрокиДок = ТаблицаДок.НайтиСтроки(Отбор);
			Ном = 0;   
			ТаблицаИзмененийДок.Очистить();
			Для каждого Стр Из СтрокиДок Цикл 
				ПолучитьТаблицуИзмененийДок(Стр.Изменения, Стр.ПричинаИзменения, Стр.ДокументЗалогодателя, ТаблицаИзмененийДок);
			КонецЦикла;  
			ТаблицаДоп = ТаблицаИзмененийДок.Скопировать();
			ТаблицаДоп.Свернуть("Документ");   
			Для каждого СтрДоп  Из ТаблицаДоп Цикл 
				СтрНач = 0;
			    СтрКон = 0;  
				ОтборДоп = Новый Структура;
				ОтборДоп.Вставить("Документ", СтрДоп.Документ);
				СтрокиДок = ТаблицаИзмененийДок.НайтиСтроки(ОтборДоп);
				Для каждого СтрДок Из СтрокиДок Цикл
					Если Ном = 0 Тогда  					
						ОбластьСтроки.Параметры.Период = Стр.Период; 
						ОбластьСтроки.Параметры.Ответственный = Стр.Ответственный;
						ОбластьСтроки.Параметры.ПричинаИзмененияКИ = "";
						ОбластьСтроки.Параметры.ВидКИ = "";
						ОбластьСтроки.Параметры.СтароеКИ = "";
						ОбластьСтроки.Параметры.НовоеКИ = "";  
						СтруктураР = Новый Структура; 
						СтруктураР.Вставить("Залогодатель", Отчет.Залогодатель);
						СтруктураР.Вставить("Дата", СтрК.Период);
						ОбластьСтроки.Параметры.СтруктураР = СтруктураР;					
						ОбластьСтроки.Параметры.Документ = СтрДок.Документ;
						ОбластьСтроки.Параметры.ПричинаИзмененияДок = СтрДок.ПричинаИзменения;
						ОбластьСтроки.Параметры.ВидДок = СтрДок.Вид;
						ОбластьСтроки.Параметры.СтароеДок = СтрДок.ЗначениеСтарое;
						ОбластьСтроки.Параметры.НовоеДок = СтрДок.ЗначениеНовое;  					
						ДокументРезультат.Вывести(ОбластьСтроки); 
						СтрокаТаблицы = СтрокаТаблицы + 1;
						Ном = Ном + 1;   
						СтрНач = СтрокаТаблицы;
						СтрКон = СтрНач;
					Иначе        
						//ОбластьСтроки2.Параметры.СтруктураР = СтруктураР;
						//ОбластьСтроки2.Параметры.ВидКИ = "";
						//ОбластьСтроки2.Параметры.СтароеКИ = "";
						//ОбластьСтроки2.Параметры.НовоеКИ = "";  
						
						ОбластьСтроки2.Параметры.Документ = СтрДок.Документ;
						ОбластьСтроки2.Параметры.ПричинаИзмененияДок = СтрДок.ПричинаИзменения;
						ОбластьСтроки2.Параметры.ВидДок = СтрДок.Вид;
						ОбластьСтроки2.Параметры.СтароеДок = СтрДок.ЗначениеСтарое;
						ОбластьСтроки2.Параметры.НовоеДок = СтрДок.ЗначениеНовое;   
	                    ДокументРезультат.Вывести(ОбластьСтроки2); 
						СтрокаТаблицы = СтрокаТаблицы + 1;
						СтрКон = СтрКон + 1;
					КонецЕсли;				
				Конеццикла;
				Если НЕ СтрНач = СтрКон Тогда  
					ДокументРезультат.Область(СтрНач,7,СтрКон,7).Объединить(); 
					ДокументРезультат.Область(СтрНач,8,СтрКон,8).Объединить();
				КонецЕсли;	
			Конеццикла;	
		КонецЕсли;
	Конеццикла;	
	
	ДокументРезультат.Вывести(ОбластьПодвала);
КонецПроцедуры


&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь; 
		Расшифровка.Вставить("НеРедактировать", Истина);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", Расшифровка, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры
